(function() {
    'use strict';

    var plovdiv = [{
        id: 47,
        region: 'Plovdiv',
        fileName: '1_Plovdiv_Djumayata_1.jpg',
        title: 'Пловдив, „Джумаята”',
        description: 'Вляво Пловдивската популярна банка (1923, арх. Юрдан ЮРДАНОВ и Димитър КОЕВ), Вдясно Джумая джамия (XIV век), издигната на мястото на църквата “Св. Петка”.'
    },{
        id: 48,
        region: 'Plovdiv',
        fileName: '2_Plovdiv_AntichenTeatar_1.jpg',
        title: 'Пловдив, „Античният театър на Филипополис”',
        description: '„Античният театър на Филипополис” е сред най-добре запазените антични театри в света. Построен е през втори век по време на римския император Марк Улпий Троян (53-117г.). След 3 века е опожарен при нападение на града. Въпреки това, театърът е запазен в първоначалния си архитектурен план. Той е частично възстановен, с около 3500 места.'
    },{
        id: 49,
        region: 'Plovdiv',
        fileName: '3_Plovdiv_Alafrangite_1.jpg',
        title: 'Пловдив, „Алaфрангите”',
        description: '„Алaфрангите” – по калдъръмените улички на стария град.'
    },{
        id: 50,
        region: 'Plovdiv',
        fileName: '4_Plovdiv_Alafrangite_2.jpg',
        title: 'Пловдив, хотел „Алафрангите”',
        description: 'Хотел „Алафрангите” във възрожденска къща от 1865 г.'
    },{
        id: 51,
        region: 'Plovdiv',
        fileName: '5_Plovdiv_Alafrangite_3.jpg',
        title: 'Пловдив, „Алaфрангите”',
        description: '„Алaфрангите” – по калдъръмените улички на стария град.'
    },{
        id: 52,
        region: 'Plovdiv',
        fileName: '6_Plovdiv_Alafrangite_4.jpg',
        title: 'Пловдив, „Алaфрангите”',
        description: '„Алaфрангите” – по калдъръмените улички на стария град.'
    },{
        id: 53,
        region: 'Plovdiv',
        fileName: '7_Plovdiv_Alafrangite_5.jpg',
        title: 'Пловдив, „Алaфрангите”',
        description: '„Алaфрангите” – по калдъръмените улички на стария град.'
    },{
        id: 54,
        region: 'Plovdiv',
        fileName: '8_Plovdiv_EtnoMuseum_1.jpg',
        title: 'Пловдив, Куюмджиева къща (Етнографски музей)',
        description: 'Куюмджиева къща (Етнографски музей) - една от най-забележителните възрожденски къщи, запазили се в нашите земи, дом на пловдивския търговец Аргир Куюмджиоглу, построена е през 1847г. Построена е през 1847 година. Площта й е около 570 квадратни метра, има 4 етажа с 12 големи стаи, 2 салона и около 130 прозореца. Тя е връх в пловдивската възрожденска архитектура.'
    },{
        id: 55,
        region: 'Plovdiv',
        fileName: '9_Plovdiv_HisarKapia_1.jpg',
        title: 'Пловдив, Хисар Капия',
        description: 'Хисар Капия - порта през старинните крепостни стени на Филипопол датира от 11-13 век, но основите са от римско време.'
    },{
        id: 56,
        region: 'Plovdiv',
        fileName: '10_Plovdiv_HisarKapia_2.jpg',
        title: 'Пловдив, Хисар Капия',
        description: 'Хисар Капия - порта през старинните крепостни стени на Филипопол датира от 11-13 век, но основите са от римско време.'
    },{
        id: 57,
        region: 'Plovdiv',
        fileName: '11_Plovdiv_TheOldTown_1.jpg',
        title: 'Пловдив, Архитектурно-историческият резерват "Старинен Пловдив".',
        description: 'Включен е в Списъка на 100-те национални туристически обекта. Намира се в стария град на Тригълмието и включва паметници от различни епохи.'
    },{
        id: 58,
        region: 'Plovdiv',
        fileName: '12_Plovdiv_TheOldTown_2.jpg',
        title: 'Пловдив, Архитектурно-историческият резерват "Старинен Пловдив".',
        description: 'Включен е в Списъка на 100-те национални туристически обекта. Намира се в стария град на Тригълмието и включва паметници от различни епохи.'
    },{
        id: 59,
        region: 'Plovdiv',
        fileName: '13_Plovdiv_Museum_1.jpg',
        title: 'Пловдив, Областно събрание на Източна Румелия',
        description: 'Областно събрание на Източна Румелия построено 1885 г. по проект на италианския архитект Пиетро Монтани. Днес исторически музей. Притежава над 60 000 експоната.'
    },{
        id: 60,
        region: 'Plovdiv',
        fileName: '14_Plovdiv_Obshtina_1.jpg',
        title: 'Пловдив, Сградата на общината',
        description: 'Сградата на общината е проектирана от арх. Никола Нешов и е построена в периода 1912-1914г. за нуждите на Окръжната администрация. През 20-те години на XX-ти век сградата е дадена за нуждите на областното полицейско управление. В края на 50-те години в сградата се нанасят службите на Община Пловдив.'
    },{
        id: 61,
        region: 'Plovdiv',
        fileName: '15_Plovdiv_CirilMetodii_1.jpg',
        title: 'Пловдив, Храм "Св. св. Кирил и Методий"',
        description: 'Храм "Св. св. Кирил и Методий" изграден в периода 1882 – 1884 г. по проект и под ръководството на арх. Йосиф Шнитер.'
    },{
        id: 62,
        region: 'Plovdiv',
        fileName: '16_Plovdiv_Exelsior_1.jpg',
        title: 'Пловдив, Търговски център „Екселсиор”',
        description: 'Търговски център „Екселсиор” (1906 – 1911) по проект за кино на арх. А. Ставрев. При реконструкцията на арх. Едвард Христов е разкрита част от античния римски стадион, която е реставрирана и съхранена.'
    },{
        id: 63,
        region: 'Plovdiv',
        fileName: '17_Plovdiv_FlowersBuilding_1.jpg',
        title: 'Пловдив, Сградата на цветята',
        description: 'Сградата на цветята на площад „Джумаята”'
    },{
        id: 64,
        region: 'Plovdiv',
        fileName: '18_Plovdiv_MainStreet_1.jpg',
        title: 'Пловдив – Хотел „Молле”',
        description: 'Хотел „Молле” (1910) – На 1 януари 1912г. с бляскаво новогодишно тържество на ул.Княз Александър”39, отваря вратите си хотел „Молле”. В книгата за спомени тук са се разписали първото самостоятелно парно отопление в града, първият генератор за електричество, първият пловдивски асансьор. Постройката е изградена от италианския архитект Марио Пернигони, проектирал още ректората на Пловдивски университет, днешната семинария и централна гара.'
    }];

    function plovdivService() {
        return {
            plovdiv: plovdiv
        };
    }

    angular.module('belinApp.services')
        .service('plovdivService', [plovdivService]);
}());
