(function() {
    'use strict';

    var developmentPublications = [{
        id: 3,
        title: 'Проекти за 80 млн. лв. включва Инвестиционната програма за реализация на ИПГВР - Пловдив',
        edition: 'в. Строителство градът, 08.09.2016',
        abstract: 'ОП "Регионално развитие" 2007 - 2013 г. и реализираните чрез нея проекти са вече част от историята на град Пловдив. Древният град отново ще може да разчита на Европейския фонд за регионално развитие, достъпен чрез новата ОП "Региони в растеж" 2014 - 2020. Средствата за градско обновяване на Пловдив са предварително определени и възлизат на 80 851 031.52 лв. безвъзмездна финансова помощ.',
        url: 'http://gradat.bg/news/2015/11/09/2645611_proekti_za_80_mln_lv_vkljuchva_investicionnata/',
        coauthor: 'урб. Здравко Петров'
    },{
        id: 6,
        title: 'Програма "Растеж и устойчиво развитие на регионите" - инициатива с надежда за развитие',
        edition: 'в. Строителство градът, 12.05.2014',
        abstract: 'В началото на настоящата годна Министерският съвет на Република България одобри проектите, които ще бъдат финансирани през 2014 г. от публичната инвестиционна програма "Растеж и устойчиво развитие на регионите". Това безспорно е една добра инициатива, особено като се има предвид очертаващата се нулева година без действащи нови оперативни програми и съответно без нови договори с потенциалните бенефициенти.',
        url: 'http://gradat.bg/news/2014/05/12/2297685_programa_rastej_i_ustoichivo_razvitie_na_regionite_-/',
        coauthor: 'Веселин Цветанов, Петко Маринов'
    },{
        id: 7,
        title: 'В разработването на плана се стремим да мислим като "предприемчиви стопани"',
        edition: 'в. Строителство градът, 22.10.2012',
        abstract: 'Интегрираният план за градско възстановяване и развитие е "бизнес план", програма за интегрирано осъществяване на секторните политики и стратегии на общината съобразено с възможностите на пространственото планиране. Този подход се прилага, за да се постигнат по-ефективни резултати от влагането на различни видове ресурси в обновяването и развитието на градовете.',
        url: 'http://gradat.bg/interview/2012/10/22/1930007_v_razrabotvaneto_na_plana_se_stremim_da_mislim_kato/'
    },{
        id: 10,
        title: 'Без технически обосновани проекти ще останем само наблюдатели',
        edition: 'в. Строителство градът, 02.05.2010',
        abstract: 'България има национална позиция за Дунавската стратегия, придружена от 20 комплексни програми, чрез които сме обобщили приоритетите и възможните програми за реализация. Тя съдържа 250 проекта, предложени от заинтересованите страни. Сега сме в процес на определяне на няколко - например пет национални комплексни програми, или нека да ги наречем пет комплексни интегрирани макропроекта.',
        url: 'http://gradat.bg/interview/2010/05/02/895663_bez_tehnicheski_obosnovani_proekti_shte_ostanem_samo/'
    },{
        id: 11,
        title: 'Целта е да се направят добри проекти, гарантиращи устойчивост',
        edition: 'в. Строителство градът, 08.03.2010',
        abstract: 'Интегрираните планове за градско възстановяване и развитие се разработват като изискване от Европейската комисия за по-ефективно усвояване на средствата от структурните фондове на Европейския съюз. Това изискване е във връзка с прилагането на Лайпцигската харта за устойчиви европейски градове, която беше приета на неформална среща на европейските министри, отговарящи за устройството на територията през май 2007 г.',
        url: 'http://gradat.bg/interview/2010/03/08/869505_celta_e_da_se_napraviat_dobri_proekti_garantirashti/'
    },{
        id: 12,
        title: 'Националната устройствена схема е супердържавна задача',
        edition: 'в. Строителство градът, 05.01.2008',
        abstract: 'За хората, които работим в областта на устройство на територията и регионалното развитие, е голяма радост, че най-после се обръща сериозно внимание на нормативно заложена от 2001 г. със Закона за устройство на територията национална комплексна устройствена схема.',
        url: 'http://gradat.bg/news/2008/01/05/444762_nacionalnata_ustroistvena_shema_e_superdurjavna_zadacha/'
    },{
        id: 13,
        title: 'Приоритети на регионалната политика на България в процеса на присъединяване към ЕС',
        edition: 'в. Строителство градът, 25.10.2004',
        abstract: 'МРРБ е отговорно за провеждане на реформата в регионалното развитие на страната, устройството на територията и изграждането на основните мрежи и съоръжения на техническата инфраструктура. Балансираното, устойчиво развитие на националната територия е жизненоважна предпоставка за повишаване на инвестиционния интерес към България и оттам за постигането на стабилен икономически растеж и международна конкурентоспособност.',
        url: 'http://gradat.bg/news/2004/10/25/325231_prioriteti_na_regionalnata_politika_na_bulgariia_v/'
    },{
        id: 14,
        title: 'Политиката на България по отношение на прилагане на принципите на устойчивото развитие',
        edition: 'в. Строителство градът, 18.09.2004',
        abstract: 'От 1997 г. насам принципите за устойчиво развитие заемат централно място в Договора на Европейския съюз и държавите, които се стремят да се присъединят към него, трябва да ги приложат към своята цялостна политика и законова уредба.',
        url: 'http://gradat.bg/news/2004/09/18/324919_politikata_na_bulgariia_po_otnoshenie_na_prilagane_na/'
    },{
        id: 15,
        title: 'Общините трябва да подготвят планове за развитие до март 2005 г.',
        edition: 'в. Строителство градът, 26.06.2004',
        abstract: 'За да усвои предоставяните пари, в оставащите до приемането ни 2 и половина години, България трябва да подготви цялата нормативна база, планове и проекти и да осигури за съфинансиране още толкова пари.',
        url: 'http://gradat.bg/news/2004/06/26/324846_obshtinite_triabva_da_podgotviat_planove_za_razvitie/'
    },{
        id: 16,
        title: 'Еврофинансиране на градски иновативни дейности',
        edition: 'в. Капитал, 29 юни 2016',
        abstract: 'През май и в началото на юни в публичното пространство се появиха три интересни публикации. На 11 май Институтът за пазарна икономика представи новото си изследване "Успехите и провалите на българските общини 2011 – 2014", което се базира на преглед и анализ на одитните доклади на Сметната палата.',
        url: 'http://www.capital.bg/biznes/konsult/2016/06/29/2786741_evrofinansirane_na_gradski_inovativni_deinosti/'
    }];

    function developmentPublicationsService() {
        return {
            publications: developmentPublications
        };
    }

    angular.module('belinApp.services')
        .service('developmentPublicationsService', [developmentPublicationsService]);
}());
