(function() {
    'use strict';

    var ruse = [{
        id: 1,
        region: 'Ruse',
        fileName: 'Ruse_Alexandrovska_1.jpg',
        title: 'Русе, ансамбъл по централната улица „Александровска”',
        description: 'Жилищно-търговската сграда на братя Папаманоли, построена през 1897 г. по проект на арх. Едвин Пиетрицки. Следва банката на Бурови , сторена 1912 г. по проект на арх. Янович.'
    }, {
        id: 2,
        region: 'Ruse',
        fileName: 'Ruse_Alexandrovska_2.jpg',
        title: 'Русе, ансамбъл по централната улица „Александровска”',
        description: 'Жилищно-търговската сграда на братя Папаманоли, построена през 1897 г. по проект на арх. Едвин Пиетрицки. Следва банката на Бурови , сторена 1912 г. по проект на арх. Янович.'
    }, {
        id: 3,
        region: 'Ruse',
        fileName: 'Ruse_Batemberg_1.jpg',
        title: 'Русе, Сградата на бившето Окръжното управление',
        description: 'Сградата на бившето Окръжното управление e построена през 1882 – 1892 г. от арх. Фридрих Грюнангер. Първоначалният замисъл е сградата да се използва като резиденция на княз Александър I Батенберг, затова и до днес се нарича Дворецът Батенберг. Днес в тази сграда се помещава Регионалният исторически музей.'
    }, {
        id: 4,
        region: 'Ruse',
        fileName: 'Ruse_Bulgaria_1.jpg',
        title: 'Русе, Сградата на Застрахователно дружество „България“ ',
        description: 'Сградата на Застрахователно дружество „България“ е построена през 1891 г. по  проект на Едуард Винтер е Фреските в интериора са от 1901 година на италианския художник Медеа Джовани Пигор.'
    }, {
        id: 5,
        region: 'Ruse',
        fileName: 'Ruse_ByalaBridge_1.jpg',
        title: 'Беленският мост',
        description: 'Беленският мост е построен от Колю Фичето и се смята за постижение на българското възрожденско инженерно-строително и архитектурно изкуство. Работата по него започва през 1865 г. и завършва през 1867 г. Построен е по заповед на Мидхат паша.'
    }, {
        id: 6,
        region: 'Ruse',
        fileName: 'Ruse_CommercialBank_1.jpg',
        title: 'Русе, Сградата на бившата Кредитно-търговска популярна банка',
        description: 'Сградата на бившата Кредитно-търговска популярна банка, построена през 1910-11 г. от инж. Геро Геров. Ул. „Хр. Г. Данов” №2.'
    }, {
        id: 7,
        region: 'Ruse',
        fileName: 'Ruse_CommercialCamera_1.jpg',
        title: 'Русе, Сградата на Търговско-индустриалната камара',
        description: 'Сградата на Търговско-индустриалната камара (открита 1916 г.) е дело на арх. Никола Лазаров. Сега в нея се помещава регионалната библиотека „Любен Каравелов”'
    }, {
        id: 8,
        region: 'Ruse',
        fileName: 'Ruse_CommercialCamera_2.jpg',
        title: 'Русе, Сградата на Търговско-индустриалната камара',
        description: 'Сградата на Търговско-индустриалната камара (открита 1916 г.) е дело на арх. Никола Лазаров. Сега в нея се помещава регионалната библиотека „Любен Каравелов”'
    }, {
        id: 9,
        region: 'Ruse',
        fileName: 'Ruse_CommercialCamera_3.jpg',
        title: 'Русе, Сградата на Търговско-индустриалната камара',
        description: 'Сградата на Търговско-индустриалната камара (открита 1916 г.) е дело на арх. Никола Лазаров. Сега в нея се помещава регионалната библиотека „Любен Каравелов”'
    }, {
        id: 10,
        region: 'Ruse',
        fileName: 'Ruse_Dohodno_1.jpg',
        title: 'Русе, Доходното здание и достолепната сграда на бившият хотел „Тетевен”',
        description: 'Доходното здание и достолепната сграда на бившият хотел „Тетевен”, построен през 1897 г. от италианския арх. Нино Росети за дом на фабриканта Андре Тюрийо.'
    }, {
        id: 11,
        region: 'Ruse',
        fileName: 'Ruse_Dohodno_2.jpg',
        title: 'Русе, Доходното здание',
        description: 'Доходното здание е построено е в периода 1898-1902 г. от виенският архитект Петер Паул Бранг (1852/1925). Името произлиза от идеята сградата да носи на тогавашното училищно настоятелство доходи от наемите за предвидените магазини, театрален салон, библиотека и казино.'
    }, {
        id: 12,
        region: 'Ruse',
        fileName: 'Ruse_Dohodno_4.jpg',
        title: 'Русе, Доходното здание',
        description: 'Доходното здание е построено е в периода 1898-1902 г. от виенският архитект Петер Паул Бранг (1852/1925). Името произлиза от идеята сградата да носи на тогавашното училищно настоятелство доходи от наемите за предвидените магазини, театрален салон, библиотека и казино.'
    }, {
        id: 13,
        region: 'Ruse',
        fileName: 'Ruse_DohodnoZora_1.jpg',
        title: 'Русе, Доходното здание и читалище „Зора”',
        description: 'Доходното здание е построено е в периода 1898-1902 г. от виенският архитект Петер Паул Бранг (1852/1925). Името произлиза от идеята сградата да носи на тогавашното училищно настоятелство доходи от наемите за предвидените магазини, театрален салон, библиотека и казино.'
    }, {
        id: 14,
        region: 'Ruse',
        fileName: 'Ruse_Girdap_1.jpg',
        title: 'Русе, Сградата на Акционерно дружество „Гирдап“',
        description: 'Сградата на Акционерно дружество „Гирдап“, което е първата частна банка в България, основана през 1881 г. Сградата е построена през 1896 г. по проект на архитектите Стоян Золотов и Удо Рибау. Понастоящем сградата се използва от Сметната палата.'
    }, {
        id: 15,
        region: 'Ruse',
        fileName: 'Ruse_LaButica_1.jpg',
        title: 'Русе, „Ла Бутика”',
        description: '„Ла Бутика” - търговската къща на Елиезар Канети, дядо на нобеловия лауреат за литература Елиас Канети, строена през 1898г.'
    }, {
        id: 16,
        region: 'Ruse',
        fileName: 'Ruse_MusicSchool_1.jpg',
        title: 'Русе, Старото музикално училище',
        description: 'Сградата построена през 1900-1901 г. от Протестантската общественост в България е дело на арх. Удо Рибау и инж. Тодор Тонев.'
    }, {
        id: 17,
        region: 'Ruse',
        fileName: 'Ruse_SimeonovHouse_1.jpg',
        title: 'Русе, Къщата на банкера Иван Симеонов',
        description: 'Къщата на банкера Иван Симеонов, построена през 1895 г. от арх. Нигохос Бедросян. Сега в нея се помещава Католическата никополска епархия.'
    }, {
        id: 18,
        region: 'Ruse',
        fileName: 'Ruse_Svoboda_1.jpg',
        title: 'Русе, Площад „Свобода”',
        description: 'Площад „Свобода” - Градската градина, Паметникът на Свободата и Доходното здание 1898/1902 на арх. Петер Паул Бранг (1852/1925).'
    }, {
        id: 19,
        region: 'Ruse',
        fileName: 'Ruse_Svoboda_2.jpg',
        title: 'Русе, Площад „Свобода”',
        description: 'Площад „Свобода” - Градската градина, Паметникът на Свободата и Доходното здание 1898/1902 на арх. Петер Паул Бранг (1852/1925).'
    }, {
        id: 20,
        region: 'Ruse',
        fileName: 'Ruse_Turio_1.jpg',
        title: 'Русе, Къщата на Андре Тюрийо',
        description: 'Къщата на Андре Тюрийо или „Виенската къща“, както я нарекли русенци, е най-красивата къща в Русе, завършена през 1900 г. по проект на арх. Едвин Пиетрицки.'
    }];

    function ruseService() {
        return {
            ruse: ruse
        };
    }

    angular.module('belinApp.services')
        .service('ruseService', [ruseService]);
}());
